{
  "buttons": {
    "continue": "Continue",
    "returnToLobby": "Return To Lobby",
    "submit": "Hit <key>Submit</key> to see what happens!"
  },
  "steps": {
    "introWelcome": "Welcome to <key>HexStrike</key>! The <u><key>objective</key></u> of the game is to knock your opponent off <move>land</move> (green hexes) without falling off yourself. If you go 5 or more tiles away from <move>land</move> into the <key>abyss</key> (dark blue hexes), or if you have no cards to play while in the <key>abyss</key>, you lose!",
    "timelineTurn": "When your turn is up, you will see <key>{E}</key> on the <key>timeline</key> above. Multiple players can have turns <u>simultaneously</u>.",
    "selectStepActive": "Let us start by selecting your <key>ACTIVE</key> card. We are far from our opponent, so select <move>STEP</move> by clicking it, or drag it to the <key>Active slot</key>.",
    "selectFumikomiPassive": "Great. To make a legal move, select a <key>PASSIVE</key> card of the other type. Green cards are <move>movement</move>, purple cards are abilities. Let us use <key>Fumikomi</key> so we can build on it later.",
    "selectRotationOpen": "Fantastic. Last step: select <key>rotation 0</key> to keep facing the same direction while we <move>move</move> in.",
    "timelineMoving": "Look at that, things are <move>moving</move>. Check the <key>timeline</key> anytime, and <u>rewind</u> if you miss anything. In this case, your opponent chose a longer sequence of actions, so you can see ahead into the future. If two actions occur on the same 'beat' on the timeline, the one with higher <key>priority</key> goes first. The priority number is shown on the golden badge, which is also in the upper right corner of each card.",
    "cardSymbols": "You can browse your cards and read the symbols. {m} moves in a straight line, {2j} jumps, {a} attacks, {a-La-Ra} attacks multiple angles, and {c} attacks then moves. {i} {X1} {X2} are modifiers that change how the card works in the active text. You'll read the card text itself to see what they do.",
    "selectJabActive": "Let's get in a quick <attack>attack</attack> before our opponent can react. Select <attack>Jab</attack> as your <key>ACTIVE</key> card.",
    "selectFlechePassive": "Now choose <move>Fleche</move> as your <key>PASSIVE</key> card. Its passive removes a final <key>{W}</key> and speeds this move up. <key>{W}</key> is just a <u>WAIT</u> action. It does nothing, so removing them is almost always a good idea.",
    "selectRotationJab": "Our opponent is straight ahead, so keep <key>rotation at 0</key> and submit. No fancy footwork just yet.",
    "damageAndKbfExplainer": "Great hit! On a card, <attack>damage</attack> is shown in the lower left with {DamageIcon} and Knockback Factor (<key>KBF</key>) is shown with {KnockBackIcon}. You can see how much <attack>damage</attack> was actually dealt on the timeline in the {red damage capsule}, and it is also tracked on the characters. On the timeline, you can also see how far they were launched with your <attack>attack</attack> in the {KnockBackIcon} (in this case, 0). The more <attack>damage</attack> your opponent has accumulated and the higher the card's <key>KBF</key>, the further the opponent will get launched!",
    "comboYes": "You triggered {Co}, a <key>combo</key> window. When a card with {Co} lands a hit, you get to move onto another similar <attack>attack</attack> card early, as long as there is one in your hand. Choose <key>Yes</key> to chain into another combo card.",
    "selectCrossSlashActive": "Fantastic, now select <attack>Cross Slash</attack> as your <key>ACTIVE</key> card.",
    "selectStepPassive": "Pick <move>Step</move> as the passive card.",
    "selectRotationCrossSlash": "Rotate <key>0</key> and submit.",
    "crossSlashResolution": "Look how far they flew. <attack>Cross Slash</attack> has strong {KnockBackIcon} <key>KBF</key>. We are out of combo cards now, so the chain ends. On <key>{E}</key>, if your character is on <move>LAND</move>, your hand refills: <move>movement</move> is always these 4 cards, and abilities redraw from your 12-card deck. But <u>be careful</u>, you do not get to refresh your hand if you are over the <key>ABYSS</key>. And if you have no cards left over the <key>ABYSS</key>, you lose the game!",
    "selectFeintActive": "You are now selecting a move as the same time as your opponent. Given that he might come back, let's get out of the way. Select <move>Step</move> as your <key>ACTIVE</key> card to move out of the line.",
    "selectFlechePassiveAgain": "Use <guard>Guard</guard> as passive, just in case they try to hit you as you move.",
    "selectRotationDodge": "Rotate <key>R1</key> to move out of the way. Now we're dancin'.",
    "hipThrowIntro": "They moved out of the way. Let us punish it with <attack>Hip Throw</attack>. Throw attacks with {throw kbf icon} always launch a fixed distance, are <guard>unblockable</guard>, and let you choose direction.",
    "selectHipThrowActive": "Select <attack>Hip Throw</attack> as <key>ACTIVE</key>.",
    "selectStepPassiveHipThrow": "Use <move>Step</move> as passive so we still have simple movement coverage.",
    "selectRotationHipThrow": "Rotate <key>3</key> so we face the right way, then submit.",
    "throwDirection": "Great grab! Now let's throw them over your shoulder, into the <key>abyss</key> to keep them close, but off the <move>land</move>. Click the arrow that is pointed at your character.",
    "selectFeintScoutActive": "Hmm, you and the opponent are again in a <u>simultaneous move</u>. They probably expect you to <attack>attack</attack>, and will move out of the way or <guard>block</guard>. We can <key>Feint</key> to see what they do before choosing our own significant action. Go ahead and select <key>Feint</key>.",
    "selectStepPassiveScout": "Let's reserve our larger moves just in case we get displaced. Use <move>Step</move> for passive",
    "selectRotationScoutFeint": "<key>Feint</key> doesn't allow much rotation, as you can see the allowed rotations in the upper right of the card. A * allows for any rotation, otherwise cards give a range. We're only pausing for a single beat, so let's stay facing the same way.",
    "finishIntro": "Perfect. Your opponent used <guard>Parry</guard> too early, leaving themselves open to a delayed <attack>attack</attack>. Use <attack>Smash Attack</attack> to send them to oblivion! The timeline shows <guard>Parry</guard> ends before <attack>Smash</attack> connects, guaranteeing you the hit.",
    "selectSmashActive": "Select <attack>Smash Attack</attack> as <key>ACTIVE</key>.",
    "selectAnyMovementPassive": "Any <move>movement</move> card works for passive. Pick your favorite.",
    "selectRotationFinish": "Set rotation to <key>3</key> so you do not miss, then submit.",
    "victoryOutro": "Congrats! You knocked your enemy out of the arena. Now take your skills into real matches against friends or bots."
  }
}
